In [1]:
import numpy as np
import pandas as pd

from scipy import stats
import statsmodels.api as sm

import matplotlib.pyplot as plt

In [2]:
data = pd.read_excel('/Users/dimitritsioutsiopoulos/Desktop/Python/New_Files/Housing.xlsx')

In [3]:
data

,House Price,House Size (sq.ft.),State,Number of Rooms,Year of Construction
0,1116000,1940,IN,8,2002
1,860000,1300,IN,5,1992
2,818400,1420,IN,6,1987
3,1000000,1680,IN,7,2000
4,640000,1270,IN,5,1995
5,1010000,1850,IN,7,1998
6,600000,1000,IN,4,2015
7,700000,1100,LA,4,2014
8,1100000,1600,LA,7,2017
9,570000,1000,NY,5,1997
10,860000,2150,NY,9,1997
11,1085000,1900,NY,9,2000
12,1250000,2200,NY,9,2014
13,850000,1100,TX,4,2017
14,640000,860,TX,4,1997
15,900000,1325,TX,6,1997
16,730000,1350,TX,6,2000
17,750000,1600,TX,6,1992
18,650000,950,TX,2,1987
19,680000,1250,TX,4,2000

In [5]:
data[['House Price', 'House Size (sq.ft.)']]

    House Price  House Size (sq.ft.)
0       1116000                 1940
1        860000                 1300
2        818400                 1420
3       1000000                 1680
4        640000                 1270
5       1010000                 1850
6        600000                 1000
7        700000                 1100
8       1100000                 1600
9        570000                 1000
10       860000                 2150
11      1085000                 1900
12      1250000                 2200
13       850000                 1100
14       640000                  860
15       900000                 1325
16       730000                 1350
17       750000                 1600
18       650000                  950
19       680000                 1250

Univariate Regre